{"Knowledge/12-Week":{"title":"12 Week","links":["The-12-week-year-book","Knowledge/Future"],"tags":["meta"],"content":"Why\nFor many years I have operated on yearly plans. Then I would break those down to quarters then weeks then days. The issue with this was that it encouraged me to take a year to make meaningful change.\nThis also meant that if I slipped up one quarter it was fine because the “deliverable” wasn’t due till year end and I could make up for it in the next quarter. This led to some very busy Q4s and less meaningful change standing the test of time.\nIn school it was much the same just swap in semesters for quarters.\nWhat\nThe idea of this was from The 12 week year book. Basically the idea is that I needed to have a “right sized” cadence of delivery. Something large enough to make meaningful change but not too large as to encourage procrastination.\nI am not married to it being 12 weeks but something in that general area seems about right. They do loosely sync up with quarters.\n52 weeks a year\n48 weeks a year for execution\n4 weeks for planning / downtime\nThe order goes something like\n\nWeek of planning the next 12 week\n12 weeks of execution\nWeek of review / planning / taking a breather\n12 weeks of execution\nWeek of review / planning / taking a breather\n12 weeks of execution\nWeek of review / planning / taking a breather\n12 weeks of execution\n\nToward end of year / beginning of next year the holiday season will end up breaking it up a bit shortening a 12 week here or there but same general plan.\nOnce again nothing magic about the number 12. Unless of course we consider the sum of its divisors (1, 2, 3, 4, 6) equals 16, which is greater than 12 making 12 the smallest of the abundant numbers\nOutcome\nNow I aim to build 12 week plans with the following characteristics.\n\nThey need to move me meaningfully and sustainably toward the Future\n\nNew habit, lifestyle change, big life moves, new skill acquisition, etc.\n\n\nThey must be tangible, measurable in some way.\n\nI usually prefer to have a leading metric be my guide during the 12 week, and a trailing metric inform me if that change is having the effect I was hoping for during planning. I don’t concern myself with the trailing metric when I’m executing the 12 week.\n\n\nI limit myself to 2 at a time\n\npart of me wishes I could make this one at a time\nMy 2 are 1 for professional life and 1 for personal\n\nSimplified example from a few years ago\n\nProfessional: Move to a large enterprise company\nPersonal: Move into the city proper\n\n\n\n\n\n\n"},"Knowledge/Caffeine-alarm":{"title":"Caffeine alarm","links":["Knowledge/Daily"],"tags":["practice"],"content":"Summary\nI like coffee. I drink much coffee. Drink coffee late I stay up. I set a daily alarm (currently at 2:30) as my “Last call” at this time should I want another cup I may go and grab my last cup. By 3, no more coffee."},"Knowledge/Capture":{"title":"Capture","links":["Notion","Processing"],"tags":["meta"],"content":"What?\nCapture for me is making sure that all ideas and requests go to one place so that I can process them at one time. From there they go to die. Few will survive and live on to the done column.\nIn Practice\nCurrently I use Notion as my primary capture tool. I have a button on all screens of my phone and a hotkey on my computer that once hit allows me to write down the thought.\nThese get processed later in Processing for now they sit in an intake list.\nWhy?\nMy brain loves to have ideas and generally loves to over value ideas. There are two primary issues that caused me to adopt this Capture system.\n\nI can tell my brain to let it go\n\nI will stay stuck on an idea loving the idea and playing with it in my head like a distracting toy. This takes me off task and away from what I was intending to remain focused on.\nThis practice allows me to tell my brain: “It’s there we will think about it later now back to task”. If I don’t do this my brain likes to constantly remind me of the idea while working as to now forget it.\n\n\nI don’t make good investment decisions in the moment\n\n\nIf I allow my mind to make a call right then and there about whether or not I will or will not proceed with some idea or solving some problem I am more likely to spend my time in wasteful a manner.\nI generally over value new ideas and find additional time between idea inception and decision making allows me to increase the rationality of my decisions. Especially around how I spend my time.\n\n\n\n\nI’m sure having capture systems has given me more positive benefits than what is listed above. In my professional life where I need to juggle multiple priorities being organized helps. But the above 2 are my primary reasons why I put up with the toil."},"Knowledge/Daily-Plan":{"title":"Daily Plan","links":["Knowledge/Daily","Journaling","Working-Memory","Knowledge/Weekly-review-of-days"],"tags":["practice"],"content":"Summary\nDaily I make a plan of action in the morning. It’s a simple checkbox todo list. I also do a bit of Journaling here. Mostly to help me think through what is taking up space in my head and address it.\nBody\n\nTodo list for the day\nThis serves as my note for my Working Memory for the day\n\nBecomes my one stop shop for anything during that day\n\n\nAt the end of the day I write up a “Wind Down” which is summarizing the day mostly for use in the Weekly review of days so that I don’t have to read a giant wall of rambling text on Sunday.\n\nOutcomes\n\nFeeling: Relaxed and positive\nThinking: Confident in a plan of action for the day\n"},"Knowledge/Daily":{"title":"Daily","links":["Knowledge/Weekly","Knowledge/Weekly-review-of-days"],"tags":["meta"],"content":"\n\n                  \n                  Daily has the most variation \n                  \n                \n\nI’m human, This is my structure for days. Sometimes I am good at executing this. Sometimes my arm chair and I are having too good of conversation to be bothered with the day.\n\n\nOverview\n\nMorning plan\n\nHere I like to just have a half journal half todo list.\n\n\nWorking memory in the day?\n\nDo I even truly do this right now?\nI write things here as a catch all, if there is a quick thought or action I need to take care it goes on this as a working document\n\n\nMy work vault\n\nDaily working has more applicability here\nI have to do this for data privacy reasons in a regulated environment I would love to just have 1 vault but alas information security wins out.\n\n\nShutdown\n\nLike cooking at the end of my shift I clean house\nWork shutdown\n\nBest way for me to take off my work concerns and wind down, this is my marker in the day to switch modes\n\n\n\n\n\nRelated Practices\nWeekly Review\nI usually make a call out on the daily note that is a nice synopsis or take away of the day some items that I know I need to think about or something. The use of this is that during Weekly Review when I am reviewing the week this section is a condense form that I can quickly read to gather the just of anything I may need to call attention to when reviewing the week.\n\nWeekly review of days\n"},"Knowledge/End-of-Day-Entertainment":{"title":"End of Day Entertainment","links":["Sleep","Stormlight-Archive"],"tags":["practice/entertainment"],"content":"Supports my Sleep, I am not a good sleeper and through a bunch of testing this has been one of the most impactful ways to get to bed on time for me.\nFirst I have the last few hours of the day (currently 1.5 hrs) reserved for entertainment. I primarily use this time to socialize with friends catch a game online or watch a show. From there I go into a short shutdown routine which concludes with me reading a good fantasy book - currently reading Stormlight Archive"},"Knowledge/Future":{"title":"Future","links":["Knowledge/make-an-picture-album-of-things-that-resonate-to-future-vision","Knowledge/The-practice-of-recording-things-that-resonate-with-you"],"tags":["meta"],"content":"Overview\nI like to map out my view of the future. A bit of a map of my current view of the future. I don’t call it a 5 year plan because I have no clue how far off it is. I do this to primarily distill what it is that I’m after.\nTwo key things with this.\n\nI prefer to frame this in terms of actions not outcomes\nI must represent uncertainty in this view\n\nI find that exploring the assumptions / uncertainty in my view of the future is the thing that gives me the most clarity on what is actually important to me.\n\n\n\nRelated Practices\nmake an picture album of things that resonate to future vision\nThe practice of recording things that resonate with you"},"Knowledge/Learning-and-Progressive-Overloading":{"title":"Learning and Progressive Overloading","links":["Knowledge/Progressive-Overloading","Knowledge/Hypertrophy","Knowledge/Learning","Knowledge/Generation-Effect","Knowledge/spaced-repetition-system","Knowledge/Rate-of-Perceived-Exertion","Knowledge/Andy-Matuschak-anki-prompt-article-takeaways","Knowledge/Retrieval-Practice","Knowledge/write-essays-to-learn","Sources/generation-mentioned-in-the-mini-essay-idea","Knowledge/How-to-Read-a-Book"],"tags":["in-progress"],"content":"\nProgressive Overloading is to Hypertrophy as writing essays is to Learning\n\nEssays\n\nEffort + use of Generation Effect\n\n\nEffort promotes the learning\nGeneration Effect aids the retention\n\n\n\nProgressive overloading → Effort → Hypertrophy\nspaced repetition system → Effort → Learning\n(reading levels) → Effort → Learning\nspaced repetition system → Effort → Learning\n\n\nTo build muscle mass one progressively increases the weight or reps to maintain the level of effort necessary to do the lift\n\nThis is frequently using in number in routines (reps left in tank) - Rate of Perceived Exertion\n\n\n\nTo reinforce memories the key theme of Andy Matuschak anki prompt article takeaways for Retrieval Practice\n\nis effortful\nSRS can be used to Produce learning\n\n\n\nThe idea write essays to learn makes use of Generation Effect\n\ngeneration mentioned in the mini essay idea\n\n\n\nThe core idea of How to Read a Book is that increasing the effort exerted will increase the understanding distilled from the book\n\nIncrease effort to increase understanding\n\n\n"},"Knowledge/My-Current-Understanding-of-My-Mission":{"title":"My Current Understanding of My Mission","links":["Quintin-Donnelly"],"tags":[],"content":"\n\n                  \n                   Quintin Donnelly\n                  \n                \n\nI aspire to be a keeper of the tavern, where the mind’s odyssey finds liberation to set free ideas from their untold journeys.\n\n"},"Knowledge/New-Year's-Resolutions":{"title":"New Year's Resolutions","links":["Bystander-Effect"],"tags":[],"content":"90% socially acceptable lying to oneself by using over sized cadences to create a Bystander Effect with future versions of oneself."},"Knowledge/Set-Play-Calendar-Implementation-Testing":{"title":"Set Play Calendar Implementation Testing","links":["Knowledge/Set-play-day","Knowledge/The-Way-I-Work-v2","Full-Calendar-Obsidian-Plugin","Time-Ruler-Obsidian-Plugin","Templater-Obsidian-Plugin","Tracker","Knowledge/Daily-Plan","Google-Calendar"],"tags":[],"content":"Background\nThinking through the idea Set play day and how I could test it out in my current The Way I Work v2. If useful I’ll keep if not I’ll throw it away.\nFor now I’ll think through how I would actually do it. Testing this out and it’s affects comes later.\nFlow of thought\n\n\nHow should I store set play?\n\nDoes this need to be automated? Should I build this out manual prove set play is useful then reach for tools to help the side effects of extra capacity to use?\n\nyeah\nWhat is the least effort way to do it\n\nWhat does it need to do?\n\nRequirements\n\ndefine A day with set blocks of time\nDefine a week?\n\nI don’t’ know if I have the cadence of a week template really needed lets rule out of scope focus on day usecase\n\n\nTagging what practices that template accomplishes\n\nThis would help me find templates that would give me chess and other tasks needing to be done\n\n\nHow do I manage template bloat?\n\nwill selecting a template just be more work than planning that day?\n\nThe idea is that it could help with batching\nWill need to just keep an eye on this\n\n\n\n\n\n\nOptions that I see\n\nNotion\n\nCopy pasting from a calendar database or maybe even it’s templates being able to have subtasks that are relative to it’s parent so that it schedules.\nCould see then if google cal sync solves long term auto if needed\nPractices would need to be duplicated from Obsidian documentation for The Way I Work v2 and to be also tagged in notion.\n\n\nObisidian?\n\nnotes with links to the practices they accomplish - that allows be to filter them to active practices\n\nShould make a tag to deprecate practices I leave behind\n\n\nThis would mean my plans are in markdown format.. That might work but that might make automation harder long term if needed\n\n\n\n\nI should test out obsidian\n\nIt can be hard to get a sense of time in markdown to see what is too crowded of a day or whether it would fit with standing meeting that is on the day already\n\nMight explore the Full Calendar Obsidian Plugin to fix that.\n\nI don’t know if it can do templates but it can be a calendar in the vault\nMight look for how Time Ruler Obsidian Plugin plays with these as well\n\nTested this out too cumbersome doesn’t solve any of my above issues.\n\n\nI could use Full Calendar Obsidian Plugin and Templater Obsidian Plugin to make these tempaltes\n\nThis looks promising\nTesting this out I am able to make a templater template that gives me the ability to inject the template into the calendar\n\nNow I need to test Calendar in Obsidian → google calendar or similar\nThere is a bug in the full calendar implementation fo the EventStore for calendar events. It’s primary key is the event id coming from the ical source. These id’s are not unique in the case of adding multiple ical sources where one calendar may share an event with another. Thus they are failing to import due to unique key constraint.\n\nHousehold calendar and personal calendar are the cause of the conflict in this case\n\n\n\n\nAnother issue is tagging in this\n\nThe tags get applied when using the template need to test removal prior to template use\nTesting using tags in a templater comment to see if obisidian will pick it up for search but templater won’t propagate it\n\nWorks. using &lt;%**%&gt; and embedding the tags inside of that.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen I pick a set play how do I get it on the calendar?\n\nPotential plugin for browser to do the setting\nCould also just write using the API\n\nAPI seems reasonable but won’t do it until the process shows value\n\n\n\n\n\nHow do I make sure that I’m doing my chess or other activities at a good cadence if I’m relying on the occurrence of a set play?\n\nMy Tracker setup will play this role.\n\n\n\nOutcome\n\nUse my Daily Plan practice to pick a set play.\nUse Templater Obsidian Plugin to stamp out the events for that set play\n\nCan tag the template with the practices these set plays accomplish\n\n\nUse Full Calendar Obsidian Plugin to view these events on calendar view to rationalize time visually\nGoogle Calendar remains source of truth for executing the day’s plan\n"},"Knowledge/The-Way-I-Work-v2":{"title":"The Way I Work v2","links":["My-Cadences","Knowledge/The-Way-I-Work-v2","Knowledge/Future","Knowledge/Yearly","Knowledge/12-Week","Knowledge/Weekly","Knowledge/Daily","tags/practice","Tracker","Knowledge/Caffeine-alarm","Knowledge/Working-in-Public","Google-Calendar","Knowledge/Obsidian","Notion","Knowledge/spaced-repetition-system","Anki","Knowledge/Capture"],"tags":["meta","practice"],"content":"Background\nThe purpose of “the way I work” series of writing is to track what my process actually is.\nPersonally I use it as a bit of an audit. My workflow goes through expansions and contractions naturally. “The way I work” is a practice I do to help with contracting my workflow and distilling it down to the essential parts.\n\n\n                  \n                  Simplification \n                  \n                \n\nIf you force me to write down my process it will become much more simple… Because I’m lazy, and I use that to my advantage\n\n\nSo I write this for me with the goal of simplification. Others may find it useful as a way to see how I work and steal parts for themselves.\n\n\n                  \n                  Adopt with Caution \n                  \n                \n\nThe way we work is very personal. Two recommendations:\n\nDon’t adopt multiple things at once, resist that urge. Add most valuable thing first, evaluate it’s effect, keep or discard, and then repeat.\nTake the WHY of my process and ask yourself it applies to you. The specifics of how I do it are irrelevant, the notes I take, capture systems imployed, etc. don’t matter as much as the thing I’m trying to do and how my systems help me do it.\n\n\n\nThe Core\nThe way I view my system today is through the lens of two buckets.\nCadence\nThe goal is to make sure that I balance short term and long term thinking. While also ensuring I don’t spend too much time on “meta” work. I want the vast majority of my time going towards actually doing.\nPractices\nThings that help me DO. They facilitate an outcome.\nMy Cadences\n\n I should make my cadences be the parent instead of everything having The Way I Work v2 as the parent\n\nFuture\n\nA current working view of the future, anytime I’m planning or making decisions I keep this view in mind\nIt’s action based not outcome based - see Future for more details\n\nYearly\n\nTransclude of Yearly#^hhp0h7\nReflect on the year\n\n12 Week\n\nMove rocks one at a time\n\nWeekly\n\nThe strategy of the day plans\n\nDaily\n\nday plans\nDaily working memory\n\nPractices\nMany of my practices are actually linked to the cadences above. Checking thepractice tag is the best way to see all of them. I’ll call out some key ones here though.\nTrackers\n\nReally don’t care which one currently using ___ but need to measure to change.\n\nSo long as I can record quantity, yes/no style and show me my history I’m satisfied. Everything after that is bonus or fluff.\n\n\n\n\n\n                  \n                  Peter Drucker \n                  \n                \n\nIf you can’t measure, it you can’t manage it\n\n\nAlarms\n\nUsed for time ques\n\nCaffeine alarm\nmorning alarm\nnight shutdown\n\n\n\nWorking in Public\n\nThe newest addition to the way I work\nJury is out on whether or not this is valuable or not\n\nNote Taking\n\nJournal\nExpanding working memory\nPractical recall and use of side effects\n\nTodo\n\nAction based todo list\nGTD?? ish\nIt’s just a fancy list - always has been\nI do have a few ways I like it to work I’m particular\n\nImplementation\nTools in use\nHere is an idea of the tools I currently use for each of my practices. At some point I’ll update pages on each of them to explain key features of why I use that particular tool. Note that 99% of the time the tool doesn’t matter. There is a workflow I’m trying to maintain an I pick tools that fit that workflow, if multiple can then I.\nCalendar: Google Calendar\nNotes: Obsidian\nTodo: Notion\nSpaced Repetition System: Anki\nCapture: Notion - this is primary, though I do have Obsidian with Sync on my phone to do so as well there are drawbacks to doing that but lets call this allowed inefficiency for now.\nAlarms: Basic built in alarm app.\n\nOne notable exception is that to wake up I do use a light alarm\n\nI don’t know that it’s necessary but I do find that waking up over the course of a period of time makes me feel better early in the morning.\n\n\n"},"Knowledge/The-practice-of-recording-things-that-resonate-with-you":{"title":"The practice of recording things that resonate with you","links":["tags/resonate","Cal-Newport","Knowledge/Daily"],"tags":["idea","practice","completed","resonate"],"content":"Summary\nWhen something resonates with me for whatever reason (something I think about later) I capture it in a quick note and tag it withresonate\nBody\nEncountered from a Cal Newport Deep questions pod cast. It said that to help write a story of where you want to be in 10 years it’s best to find things that resonate with you. To this end record it and for a while review these each month, steady state maybe once a year. Thus I have maderesonate tag.\nI try my best to do this Daily but obviously or unfortunately I don’t encounter new things that resonate with me on a daily basis. However, it is a habit you have a build to be ready for any particular day."},"Knowledge/Weekly-review-of-days":{"title":"Weekly review of days","links":["Knowledge/Weekly","Knowledge/Daily-Plan","Handling-of-Ideas-and-Pains"],"tags":["practice"],"content":"Summary\nPractice of reviewing my days of the prior week on my Weekly review.\nBody\nI read through notes made in my daily plans and reflect on any call outs and considerations made going into my next week. Note, I handle ideas and pain points in their own way which I review in Handling of Ideas and Pains"},"Knowledge/Weekly":{"title":"Weekly","links":["Knowledge/12-Week","Knowledge/Daily"],"tags":["meta"],"content":"\nTwo parts\n\nReview\n\nMany of my practices are on the weekly cadence. Each has a goal in mind and this review session is the cue for those tasks to be done\nI do my Weekly planning on Sunday mornings. This starts with a review then a plan of the next week. All of this is then followed by any practices that I cue off of the weekly cadence.  ^hwh87r\n\nFor the practices I do on a weekly basis check the back links attached to this note\n\n\n\n\nPlan\n\nI look at my current 12 Week plan that is in effect and ask myself\n\nWhat is the next small step toward accomplishing that 12 week. If I could only do one thing to move closer to it what would I do.\nI block off my time for what I want to get done\n\nMy calendar will fill and tasks will take however much time I allow them to take\n\nSo by making the work blocks explicit on my calendar I make the default state doing that action\nNatural ability to push back on that time\n\n\nIn the Daily cadence I end up using this as my primary todo list.\nI don’t usually assign specific tasks to these blocks unless they are a scheduled action\n\nAn action that is temporally bound such as a meeting, or external due date commitment that I need to have done on a time\n\n\n\n\n\n\n\n\n\n\n"},"Knowledge/Working-in-Public":{"title":"Working in Public","links":["Discipline","Teaching-is-the-best-form-of-learning"],"tags":[],"content":"The idea of “Working in Public” has many reported benefits. Whether true or effective I am not equip to say. However, in my experience I get the following benefits from it.\n\nAccountability\n\n\nThere is something about putting my work out there that pulls an increased level of Discipline from me.\n\n\nTeaching is the best form of learning\n\n\nI use the publication of thought as a sort of teaching proxy. I needed a solution for those times when my fiance is tired of hearing me talk.\n\nThere is a high chance I will discover other benefits along the way but for now these are the main ones."},"Knowledge/Yearly":{"title":"Yearly","links":["Knowledge/New-Year's-Resolutions","Sources/Brandon-Boswell-Year-in-Review","Knowledge/12-Week","Vision"],"tags":["meta"],"content":"I don’t do much work on a yearly cadence. I find things like New Year’s Resolutions to be generally ineffective.  \nInstead I use this as a social queue to sum up the year and take a step back to appreciate the progress I’ve made. It’s interesting to look back and see the things that stick in your head.\nCheck out Brandon Boswell Year in Review for a great example that inspired me.\nFor the highest level of what I would consider plans see 12 Week or Vision."},"Knowledge/make-an-picture-album-of-things-that-resonate-to-future-vision":{"title":"make an picture album of things that resonate to future vision","links":["recall-relation-to-emotion","Knowledge/Daily","A-picture-of-the-day,week,12-week,-year"],"tags":["idea","completed","practice"],"content":"Summary\nThe idea is that I can show gallery views on phone home screen.\nBody\n\nMe\nTisha\nFamily\nFriends\nThings that resonate with me\n\nUsually this feels pretty cheesy which is perfect because cheesy is an emotion and you recall things better if they are tied to emotions. So this helps me quite a bit in making sure I keep things in my head.\nThe background is a reminder daily and I do my best to try to capture pictures everyday."},"Knowledge/spaced-repetition-system":{"title":"Spaced Repetition System","links":["Anki","Knowledge/Andy-Matuschak","Knowledge/Micheal-Neilson","Sources/Augmenting-Long-term-Memory","Knowledge/quantum-country"],"tags":[],"content":"What am I doing with this?\nWhat I use this for is effectively my takeaways. Things that resonate with me. Ah Ha moments or key insights and learnings that I want to recall the specifics of so that they are committed to memory. It’s been expanding as of late but for now that should suffice an explanation of how I use it.\nMy current system of choice is Anki - link\n\nNote I have very limited opinions on one tool over the other in this space\n\nWhat is all of this about?\nI am not qualified enough to really explain this one. For me it’s an area I’m currently exploring.\nSo\nLet me point you in the direction that peaked my interest enough for me to adopt this method.\n\n\n                  \n                  Make sources for quantum Country and notes \n                  \n                \n\nAndy Matuschak\n\nAndy’s Spaced Repetition Notes\nA stack of notes from Andy that form a compelling case to me\n\nThere were compelling enough to at least warrant a trial for me in a broader use case than just foreign language vocabulary\n\n\n\nMicheal Neilson\n\nAugmenting Long-term Memory - link to the post\n\nThe above two authors worked on a project quantum country that I find fascinating. link to quantum country. Find more about it here Andy’s notes on it"},"Sources/Brandon-Boswell-Year-in-Review":{"title":"Brandon Boswell Year in Review","links":[],"tags":["link"],"content":"His 2022 Year in review\nSomething about this spoke to me when I saw it. As time goes on you’ll forget much of a year. I like the idea of aggregating at multiple levels. Things that really stick with you in a day go in a day note, things that stuck in a week go in week note, stuck in “chunk” be that quarter, semester, or 12 week go in that note, and then a year note.\nI can imagine myself looking back at this when I’m 125 and being thankful I have these. P.S. future Quinn if you’re reading this at 125, confirmed beer is a preservative"},"Sources/Good-example-of-book-with-spaced-repitition":{"title":"Good example of book with spaced repitition","links":["Knowledge/quantum-country"],"tags":["link"],"content":"This article does the same thing that quantum country does to improve the retention. Though to a lesser extent in the long term tracking of it."},"index":{"title":"Welcome","links":["Knowledge/Working-in-Public"],"tags":[],"content":"Hello there, I put random thoughts here in an effort to test out Working in Public."}}